package hw5;

public class Main5 {
    public static void main(String[] args) {
        //перший варіант як в задачі:
        int x = 100000;
        System.out.println((x <= 10000) ? x*0.025 : ((x > 10000)&(x <= 25000)) ? x*0.043 : x*0.067);
        System.out.println(progress(x));
    }
    /*другий варіант як часто працює прогресивна шкала податка:
    підвищений відсоток нараховується виключно на частку суми яка перевищує порогове значення.
    По такій логіці буде ось так:
    з перших 10000 грн він платить 2,5%,
    з наступних 15000 (до 25000 грн) - 4,3%,
    з решти - 6,7%. */
    private static double progress(double amount) {
        return ((amount <= 10000) ? amount*0.025 : ((amount > 10000)&(amount <= 25000)) ? ((amount-10000)*0.043+10000*0.025) : ((amount-25000)*0.067+15000*0.043+10000*0.025));
    }
}
